app/controllers/users_controller.rb

  def newsletter
    users = User.where('subscribe = true')
---
SELECT "users".* FROM "users" WHERE (subscribe = true)

  def promo
    topProducts = Array.new

    Product.all.each do |product|
      topProducts.push([product.id, product.likes.count])
    end

    topProducts.sort_by{ |product_id,likes| likes}.reverse!

    User.all.each do |user|
      topPromo = Array.new

      topProducts.each do |product_id,likes|
---
SELECT "products".* FROM "products"
SELECT COUNT(*) FROM "likes" WHERE "likes"."product_id" = $1  [["product_id", 151]]
SELECT "users".* FROM "users"
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 80]]